*&---------------------------------------------------------------------*
*& Include          ZDINGTEST008D01
*&---------------------------------------------------------------------*

*&---------------------------------------------------------------------*
*& TYPES
*&---------------------------------------------------------------------*
TYPES:
  BEGIN OF TYP_MARA,
    MATNR TYPE  MARA-MATNR,     "品目コード
    ERSDA TYPE  MARA-ERSDA,     "登録日付
    ERNAM TYPE  MARA-ERNAM,     "オブジェクト登録者名
    LAEDA TYPE  MARA-LAEDA,     "最終変更日付
    AENAM TYPE  MARA-AENAM,     "オブジェクトの変更者名

  END OF TYP_MARA.

*&---------------------------------------------------------------------*
*& DATA
*&---------------------------------------------------------------------*

DATA:
  GW_MARA TYPE TYP_MARA.       "構造
