*&---------------------------------------------------------------------*
*& Report ZKAWA_TEST011
*&---------------------------------------------------------------------*
*& 演習問題13:DBレコード登録
*&---------------------------------------------------------------------*
REPORT ZKAWA_TEST011 LINE-SIZE 200.

INCLUDE:
  ZKAWA_TESTD01,                       "データ定義
  ZKAWA_TESTS01,                       "選択画面定義
  ZKAWA_TESTF01.                       "サブルーチン


*----------------------------------------------------------------------*
* 入力値チェック
*----------------------------------------------------------------------*

AT SELECTION-SCREEN ON P_MATNR.        "品目コードの入力値チェック

* 入力がなければメッセージ出力し、処理続行
  IF P_MATNR IS INITIAL.
    MESSAGE S108(ZTEST1) DISPLAY LIKE 'E'. "メッセージ「項目を入力して下さい」
  ENDIF.


*----------------------------------------------------------------------*
START-OF-SELECTION.
*----------------------------------------------------------------------*

* テーブルロック用汎用モジュール呼び出し
* パラメータで入力した値を構造体に代入し、代入した値をDBに登録
  PERFORM F_CALL_ENQU.

* テーブルロック解除用汎用モジュール呼び出し,登録した内容を出力
  PERFORM F_CALL_DEQU.

*----------------------------------------------------------------------*
TOP-OF-PAGE.
*----------------------------------------------------------------------*
* ヘッダ出力
  WRITE:
    /    TEXT-001,                     "クライアント
    20   TEXT-002,                     "品目コード
    40   TEXT-003,                     "品目テキスト
    65   TEXT-004,                     "数量
    90   TEXT-005,                     "単位
    100  TEXT-006,                     "金額
    120  TEXT-007,                     "月
    140  TEXT-008,                     "登録日
    160  TEXT-009,                     "ユーザー
    180  TEXT-010.                     "デバイス

  ULINE.
