*&---------------------------------------------------------------------*
*& Report ZKAWA_TEST011
*&---------------------------------------------------------------------*
*& 演習問題13:DBレコード登録
*&---------------------------------------------------------------------*
REPORT ZKAWA_TEST011 LINE-SIZE 200.

INCLUDE:
  ZKAWA_TESTD01,                       "データ定義
  ZKAWA_TESTS01,                       "選択画面定義
  ZKAWA_TESTF01.                       "サブルーチン

*----------------------------------------------------------------------*
START-OF-SELECTION.
*----------------------------------------------------------------------*

  PERFORM MDL_CALL_ENQU.               "テーブルロック用汎用モジュール呼び出し
  PERFORM F_SET_DATA.                  "パラメータで入力した値を構造体に代入
  PERFORM DB_INS_ZKAWA_TEST1.          "代入した値をDB:ZKAWA_TEST1に登録
  PERFORM MDL_CALL_DEQU.               "テーブルロック解除用汎用モジュール呼び出し
  PERFORM F_WRITE_DATA.                "登録した内容を出力

*----------------------------------------------------------------------*
TOP-OF-PAGE.
*----------------------------------------------------------------------*

  PERFORM F_WRITE_HEAD.                "ヘッダー出力
