*&---------------------------------------------------------------------*
*& Report ZKAWA_TEST017
*&---------------------------------------------------------------------*
*& ALV 演習問題3
*&---------------------------------------------------------------------*
REPORT ZKAWA_TEST022.

INCLUDE:
  ZKAWA_TEST22D01,                       "データ定義
  ZKAWA_TEST22S01,                       "選択画面定義
  ZKAWA_TEST22F01.                       "サブルーチン

*----------------------------------------------------------------------*
* INITIALIZATION
*----------------------------------------------------------------------*
INITIALIZATION.

  PERFORM F_CLEAR_DATA.                  "データ初期化

*----------------------------------------------------------------------*
* START-OF-SELECTION
*----------------------------------------------------------------------*
START-OF-SELECTION.

  PERFORM DB_SEL_DATA.                   "MARDとMARAからデータ取得
  PERFORM F_SET_HEAD.                    "ALVヘッダー編集
  PERFORM F_SET_LAYOUT.                  "ALVレイアウト編集
  PERFORM F_CALL_REUSE_ALV_FIELDCAT.     "フィールドカタログ取得
  PERFORM F_CALL_REUSE_ALV_GRID.         "ALV表示
